Public Attributes | List of all members
API_ZoneAllQuantity Struct Reference
Element Manager
Describes the different calculated values for zones. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | area
measured area of the zone in square meters
 double  | perimeter
perimeter of the zone
 double  | holesPrm
perimeter of holes in the zone
 double  | wallsPrm
length of perimeter walls
 Int32  | allCorners
number of the corners of the zone
 Int32  | concaveCorners
number of concave corners of the zone
 double  | wallsSurf
surface area of perimeter walls
 double  | doorsWidth
combined width of all doors in the zone
 double  | doorsSurf
surface area of doors in the zone
 double  | windowsWidth
combined width of all windows in the zone
 double  | windowsSurf
surface area of windows in the zone
 double  | baseLevel
floor level of the zone
 double  | floorThick
subfloor thickness of the zone
 double  | height
height of the zone
 double  | netarea
net area of the zone
 double  | netperimeter
net perimeter of the zone
 double  | volume
the volume of the zone
 double  | reducementArea
zone area reducement
 double  | calcArea
calculated area of the zone
 double  | totalExtrArea
total extracted area of the zone
 double  | reducedExtrArea
reduced area of the zone
 double  | lowExtrArea
extracted low area of the zone
 double  | wallExtrArea
extracted wall area of the zone
 double  | curtainWallExtrArea
extracted curtain wall area of the zone
 double  | coluExtrArea
extracted column area of the zone
 double  | fillExtrArea
extracted fill area of the zone
 double  | insetTopSurf
wall inset top surface
 double  | insetBackSurf
wall inset back side surface
 double  | insetSideSurf
wall inset side surface
 double  | filler [8]
Detailed Description
Describes the different calculated values for zones.
Remarks
See also the parameters of a zone stamp library part. This structure replaces the previous API_ZoneQuantity and API_ZoneExtraQuantity structures.